tutorials/backwardFacingStep/openHFDIBRANS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( 0.0 0.0 0.0 )	// 000
	 ( 1.01 0.0 0.0 )	// 001
	 ( 1.01 0.01091 0.0 )	// 002
	 ( 0.0 0.01091 0.0 )	// 003
	 ( 0.0 0.0 0.0013 )	// 004
	 ( 1.01 0.0 0.0013 )	// 005
	 ( 1.01 0.01091 0.0013 )	// 006
	 ( 0.0 0.01091 0.0013 )	// 007
	 ( 1.01 0.09 0.0 )	// 008
	 ( 0.0 0.09 0.0 )	// 009
	 ( 1.01 0.09 0.0013 )	// 010
	 ( 0.0 0.09 0.0013 )	// 011
	 ( 1.5 0.0 0.0 )	// 012
	 ( 1.5 0.01091 0.0 )	// 013
	 ( 1.5 0.0 0.0013 )	// 014
	 ( 1.5 0.01091 0.0013 )	// 015
	 ( 1.5 0.09 0.0 )	// 016
	 ( 1.5 0.09 0.0013 )	// 017
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	lambdaZone	( 777  8  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 3  2  8  9  7  6  10  11)	( 777  61  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 1  12  13  2  5  14  15  6)	( 377  8  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 2  13  16  8  6  15  17  10)	( 377  61  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 3  2  8  9)
			( 7  6  10  11)
			( 1  12  13  2)
			( 5  14  15  6)
			( 2  13  16  8)
			( 6  15  17  10)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 3  9  11  7)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 13  16  17  15)
			( 12  13  15  14)
		);
	}

	walls
	{
		type wall;
		faces
		(
			( 9  8  10  11)
			( 8  16  17  10)
			( 1  12  14  5)
		);
	}

	wallInsideLambda
	{
		type wall;
		faces
		(
			( 0  3  7  4)
			( 0  1  5  4)
		);
	}

); 

mergePatchPairs 
( 
); 

